Revit 2024 API
PointCloudFilterFactory Class
 A factory class for creating point cloud filters.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static class PointCloudFilterFactory
Visual Basic
Public NotInheritable Class PointCloudFilterFactory
Visual C++
public ref class PointCloudFilterFactory abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.PointClouds.PointCloudFilterFactory
See Also
PointCloudFilterFactory Members
Autodesk.Revit.DB.PointClouds Namespace